import React from "react";
import TestIS from "./TestIS";

function RusEge() {
  let in1 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl robotoMono">
      Экология – это наука о взаимодействии живых организмов и их сообществ
      между собой и со средой, в которой они обитают. Эти взаимоотношения
      изучают самые разные науки: биология и химия, астрономия и космология,
      математика и философия. … они вносят свой вклад в экологию, которая
      сегодня разделилась на ряд самостоятельных дисциплин: общую экологию,
      агроэкологию, гидроэкологию, экологию человека и т.д.
      <br />
      Активно формируется в наши дни экология культуры, или духовная экология.
      Конечно, между экологией природы и экологией культуры не может быть
      непроходимой пропасти, вместе с тем между ними есть большое различие.
      Утраты в природе до известных пределов восстановимы. Иное дело – ценности
      культурные и нравственные. Они или восстанавливаются с большим трудом, или
      вовсе исчезают, как, скажем, разрушенные памятники, сгоревшие книги,
      рукописи…
      <br />
      Если культура – это совокупность достижений общества в области науки,
      просвещения, искусства, то закрепляются эти достижения, как правило, в
      языке, в Слове. Возникнув на определённом историческом этапе, литературный
      язык сам по себе служит свидетельством уровня духовного развития народа,
      общества. Как всякое живое на Земле не может мириться со своей смертью,
      так и живая нация не может смириться с деградацией своего языка. Ведь язык
      – это и основа национальной памяти, и ключ к пониманию духовного мира,
      своего и чужого.
    </div>
  );
  let in2 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl robotoMono">
      Экология – это наука о взаимодействии живых организмов и их сообществ
      между собой и со средой, в которой они обитают. Эти взаимоотношения
      изучают самые разные науки: биология и химия, астрономия и космология,
      математика и философия. … они вносят свой вклад в экологию, которая
      сегодня разделилась на ряд самостоятельных дисциплин: общую экологию,
      агроэкологию, гидроэкологию, экологию человека и т.д.
      <br />
      Активно формируется в наши дни экология культуры, или духовная экология.
      Конечно, между экологией природы и экологией культуры не может быть
      непроходимой пропасти, вместе с тем между ними есть большое различие.
      Утраты в природе до известных пределов восстановимы. Иное дело – ценности
      культурные и нравственные. Они или восстанавливаются с большим трудом, или
      вовсе исчезают, как, скажем, разрушенные памятники, сгоревшие книги,
      рукописи…
      <br />
      Если культура – это совокупность достижений общества в области науки,
      просвещения, искусства, то закрепляются эти достижения, как правило, в
      языке, в Слове. Возникнув на определённом историческом этапе, литературный
      язык сам по себе служит свидетельством уровня духовного развития народа,
      общества. Как всякое живое на Земле не может мириться со своей смертью,
      так и живая нация не может смириться с деградацией своего языка. Ведь язык
      – это и основа национальной памяти, и ключ к пониманию духовного мира,
      своего и чужого.
      <div className="mt-6">
        1) ЖИВОЙ. Лёгкий, занимательный, выразительный. Живое изложение.
        <br />
        2) СРЕДА. Окружающие социально-бытовые условия, обстановка.
        <br />
        Из рабочей среды. 3) МИРИТЬСЯ. Терпимо относиться к чему-нибудь. М. с
        неудобствами.
        <br />
        4) ОСНОВА. Источник; главное, на чём строится что-нибудь, что является
        сущностью чего-нибудь. Экономическая о. общества.
        <br />
        5) КЛЮЧ. Металлический стержень с особой комбинацией вырезов для
        отпирания и запирания замка. Открыть дверь ключом.
      </div>
    </div>
  );
  let in3 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl robotoMono">
      Экология – это наука о взаимодействии живых организмов и их сообществ
      между собой и со средой, в которой они обитают. Эти взаимоотношения
      изучают самые разные науки: биология и химия, астрономия и космология,
      математика и философия. … они вносят свой вклад в экологию, которая
      сегодня разделилась на ряд самостоятельных дисциплин: общую экологию,
      агроэкологию, гидроэкологию, экологию человека и т.д.
      <br />
      Активно формируется в наши дни экология культуры, или духовная экология.
      Конечно, между экологией природы и экологией культуры не может быть
      непроходимой пропасти, вместе с тем между ними есть большое различие.
      Утраты в природе до известных пределов восстановимы. Иное дело – ценности
      культурные и нравственные. Они или восстанавливаются с большим трудом, или
      вовсе исчезают, как, скажем, разрушенные памятники, сгоревшие книги,
      рукописи…
      <br />
      Если культура – это совокупность достижений общества в области науки,
      просвещения, искусства, то закрепляются эти достижения, как правило, в
      языке, в Слове. Возникнув на определённом историческом этапе, литературный
      язык сам по себе служит свидетельством уровня духовного развития народа,
      общества. Как всякое живое на Земле не может мириться со своей смертью,
      так и живая нация не может смириться с деградацией своего языка. Ведь язык
      – это и основа национальной памяти, и ключ к пониманию духовного мира,
      своего и чужого.
      <div className="mt-6">
        1) Наряду с общеупотребительной лексикой в тексте используются термины
        (экология, агроэкология, гидроэкология и др.). В тексте можно выделить
        тематическую группу слов (культура, природа, ценности, памятники,
        исторический этап, литературный язык, нация, память, духовный мир и
        др.).
        <br />
        2) Использование метафор (… между экологией природы и экологией культуры
        не может быть непроходимой пропасти; ключ к пониманию духовного мира),
        антонимов (свой – чужой), сравнения (Как всякое живое на Земле не может
        мириться со своей смертью, так и живая нация не может смириться с
        деградацией своего языка.) способствует эмоциональности, выразительности
        изложения, помогает дать авторскую оценку описываемым явлениям.
        <br />
        3) Текст имеет грамматические особенности, характерные для книжной речи:
        отглагольные имена существительные (взаимодействие, вклад, утраты,
        различие, достижения и др.), конструкции с именами существительными в
        родительном падеже (между экологией природы и экологией культуры,
        свидетельством уровня духовного развития народа, к пониманию духовного
        мира и др.).
        <br />
        4) Выразительность текста обеспечивается синтаксическими средствами,
        среди которых – ряды однородных членов предложения, вводные слова.
        <br />
        5) Текст относится к научному стилю, так как основные цели автора –
        сообщить информацию, имеющую практическое значение, и дать чёткие
        инструкции
      </div>
    </div>
  );
  let in4 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      1) туфлЯ
      <br />
      2) понЯв
      <br />
      3) дОнельзя
      <br />
      4) корЫсть
      <br />
      5) Оптовый
    </div>
  );
  let in5 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      Самый обычный обед можно превратить в ПРАЗДНЫЙ, если правильно украсить
      стол.
      <br />
      Предварительное изучение ЛЕДОВОЙ обстановки в северных морях помогает
      избежать многих проблем в районе Крайнего Севера.
      <br />
      За годы пребывания в Италии композитор создал ряд оперных произведений,
      имевших у ПРИЗНАТЕЛЬНЫХ слушателей большой успех.
      <br />
      ОТБОРОЧНЫЙ тур чемпионата Европы по футболу прошёл в столице
      Великобритании – родине этого вида спорта.
      <br />В ПРОДУКТОВОЙ корзине жителя современного мегаполиса обязательно
      должны быть овощи и фрукты.
    </div>
  );
  let in6 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      Посев семян хвойных пород необходимо проводить в очень оптимальные сроки,
      когда почва влажная и температура её верхних слоёв достигает 6–8 °С для
      кедра и 8–10 °С для ели и пихты.
    </div>
  );
  let in7 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      урожай ПОМИДОРОВ
      <br />
      БЛИЖАЙШАЯ станция
      <br />
      у наших ВОРОТ
      <br />
      нет ПОЛТОРАСТА рублей
      <br />
      детские ДОКТОРА
    </div>
  );
  let in8 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      1) заг..релый, непром..каемый, к..мендант
      <br />
      2) оп..раться, см..нать (траву), поч..татель (таланта)
      <br />
      3) укр..титель (тигров), благосл..вить, симп..тичный
      <br />
      4) посв..щение (другу), недос..гаемый, у..звить
      <br />
      5) бл..стеть, с..дина (в волосах), прим..рять (поссорившихся)
    </div>
  );
  let in9 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      1) без..нициативный, вз..скать, роз..грыш
      <br />
      2) обе..доленный, чере..чур, не..держанный
      <br />
      3) пр..бить (гвоздём), пр..клеить (на бумагу), пр..брежный
      <br />
      4) арх..важный, ант..художественный, д..сквалификация
      <br />
      5) поз..прошлый (год), с..путствовать, р..зослать (письма)
    </div>
  );
  let in10 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      1) затм..вать, подароч..к
      <br />
      2) усидч..вый, ненавид..ли
      <br />
      3) аплодир..вать, издавн..
      <br />
      4) никел..вый, наста..вать
      <br />
      5) солом..нка, разборч..вый
    </div>
  );
  let in11 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      1) Во всём мире любители музыки П.И. Чайковского восхищаются как операми
      композитора так и его симфоническими произведениями.
      <br />
      2) Точный простой и живописный язык произведений М.М. Пришвина надолго
      запоминается читателям.
      <br />
      3) Кое-где при дороге попадается угрюмая ракита или молодая берёзка с
      мелкими клейкими листьями.
      <br />
      4) В преемственности традиций народных мастеров и верности стилистике
      древнейшего промысла и содержится секрет успеха и популярности гжельской
      керамики в наше время.
      <br /> 5) Лес тихо отдыхает от жгучего дневного солнца и степь обдаёт
      путника накопившимися за день цветочными запахами.
    </div>
  );
  let in12 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      В 1878 году (1) показанная на VI передвижной выставке (2) картина
      «Московский дворик» принесла В.Д. Поленову славу (3) явив рождение в
      русской живописи нового жанра (4) названного «интимным» пейзажем.
    </div>
  );
  let in13 = (
    <div className="text-slate-800  md:text-2xl lg:text-3xl text-xlmt-10  robotoMono">
      Тогда (1) быть может (2) нас спасут
      <br />
      Ирония и жалость к людям,
      <br />
      Которым мы простим их суд,
      <br />
      А сами судьями не будем.
      <br />
      Но (3) ты (4) наверно (5) не продашь
      <br />
      И не отвергнешь (6) друг весенний (7)
      <br />
      Трудолюбивый опыт наш
      <br />В пылу повальных отречений.
    </div>
  );
  return (
    <TestIS
      lesson="Русский язык Егэ"
      arr={[
        [
          {
            question: `Самостоятельно подберите определительное местоимение, которое должно
            стоять на месте пропуска в первом (1) абзаце текста. Запишите это
            местоимение. 
            `,

            RightAnswer: "все",
            name: "id1",
            inner: in1,
          },
          {
            question: `В тексте выделено пять слов. Укажите варианты ответов, в которых
            лексическое значение выделенного слова соответствует его значению
            в данном тексте. Запишите номера ответов. `,

            RightAnswer: "34",
            inner: in2,
            name: "id2",
          },
          {
            question: `Укажите варианты ответов, в которых даны верные характеристики
            фрагмента текста. Запишите номера ответов.`,
            inner: in3,

            RightAnswer: "1234",
            name: "id3",
          },
          {
            question: ` Укажите варианты ответов, в которых верно выделена буква, обозначающая
            ударный гласный звук. Запишите номера ответов.`,

            RightAnswer: "24",
            name: "id3",
            inner: in4,
          },
          {
            question: `В одном из приведённых ниже предложений НЕВЕРНО употреблено
            выделенное слово. Исправьте лексическую ошибку, подобрав
            к выделенному слову пароним. Запишите подобранное слово. `,

            RightAnswer: "праздничный",
            name: "id3",
            inner: in5,
          },
          {
            question: `Отредактируйте предложение: исправьте лексическую ошибку, исключив
            лишнее слово. Выпишите это слово. `,
            inner: in6,

            RightAnswer: "очень",
            name: "id3",
          },
          {
            question: `В одном из выделенных ниже слов допущена ошибка в образовании формы
            слова. Исправьте ошибку
            и запишите слово правильно. `,

            RightAnswer: "полутораста",
            name: "id3",
            inner: in7,
          },
          {
            question: `Укажите варианты ответов, в которых во всех словах одного ряда пропущена
            одна и та же буква. Запишите номера ответов.`,

            RightAnswer: "124",
            name: "id3",
            inner: in8,
          },
          {
            question: `Укажите варианты ответов, в которых во всех словах одного ряда пропущена
            одна и та же буква. Запишите номера ответов.`,

            RightAnswer: "134",
            name: "id3",
            inner: in9,
          },
          {
            question: `Укажите варианты ответов, в которых в обоих словах одного ряда пропущена
            одна и та же буква. Запишите номера ответов.`,

            RightAnswer: "15",
            name: "id3",
            inner: in10,
          },
          {
            question: `Расставьте знаки препинания. Укажите предложения, в которых нужно
            поставить ОДНУ запятую. Запишите номера этих предложений. `,

            RightAnswer: "125",
            name: "id3",
            inner: in11,
          },
          {
            question: `Расставьте знаки препинания: укажите цифры, на месте которых
            в предложении должны стоять запятые. `,

            RightAnswer: "34",
            name: "id3",
            inner: in12,
          },
          {
            question: `Расставьте недостающие знаки препинания: укажите цифры, на месте
            которых в предложениях должны стоять запятые. `,
            inner: in13,

            RightAnswer: "124567",
            name: "id3",
          },
          {
            question: `Ваше имя`,

            RightAnswer: "",
            name: "id3",
            mn: true,
          },
          {
            question: `Ваш номер телефона`,

            RightAnswer: "",
            name: "id3",
            phone: true,
          },
          {
            question: `Вам перезвонят и сообщать ваши результаты`,
          },
        ],
      ]}
    />
  );
}

export default RusEge;
