import React from "react";
import TestIS from "./TestIS";

function SocEge() {
  let in1 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) связь с природой; <br /> 2) изменение общественных отношений; <br /> 3)
      социальная мобильность; <br /> 4) отмена устаревших норм; <br /> 5)
      совершенствование социальной организации; <br /> 6) наличие социальных
      институтов.{" "}
      <div className="mt-6">
        Найдите два признака, «выпадающих» из общего ряда, и запишите в таблицу
        цифры, под которыми они указаны.
      </div>
    </div>
  );
  let in2 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) Последовательность стадий жизни человека, при которой детство сменяется
      юностью, юность – зрелостью, а затем наступает старость, биологически
      обусловлена.
      <br />
      2) Становление человека как личности связано с приобретением социальных
      черт и качеств.
      <br />
      3) Человек наследует моральные нормы.
      <br />
      4) Влияние генетических факторов на развитие способностей человека служит
      выражением его социальной сущности.
      <br />
      5) Природная предрасположенность человека к тем или иным видам
      деятельности проявляется в социальных обстоятельствах.
    </div>
  );
  let in3 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) ориентация на вкусы и запросы узкого круга знатоков и ценителей
      <br />
      2) использование в фильме народной музыки и эпических сюжетов
      <br />
      3) расчёт на усреднённый потребительский вкус
      <br />
      4) пропаганда традиционных семейных ценностей, понятных большинству
      зрителей
      <br />
      5) реализация создателями фильма в полной мере своих потребностей в
      самовыражении, высказывании взглядов, не разделяемых большинством
      <br />
      6) позиционирование фильма как продукта для отдыха и развлечения
    </div>
  );
  let in4 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) Коммерческие банки занимаются производством материальных благ,
      торговлей и страхованием имущества.
      <br />
      2) Паевые инвестиционные фонды объединяют средства для совместного
      приобретения активов и раздела связанных с этим рисков, прибыли или
      убытков.
      <br />
      3) Цель деятельности Банка России – защита и обеспечение устойчивости
      рубля.
      <br />
      4) Банк России осуществляет надзор за деятельностью кредитных организаций
      и банковских групп.
      <br />
      5) Коммерческие банки осуществляют эмиссию денег.
    </div>
  );
  let in5 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) оплата потреблённой электроэнергии
      <br />
      2) приобретение тканей, ниток, фурнитуры
      <br />
      3) выплата сдельной заработной платы работникам
      <br />
      4) взносы на страхование имущества фирмы
      <br />
      5) оклады администрации
      <br />
      6) погашение процентов по ранее взятому кредиту
    </div>
  );
  let in6 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) Горизонтальная мобильность предполагает переход в социальную группу,
      находящуюся на другой ступени социальной иерархии.
      <br />
      2) Личные качества человека выступают критерием социальной стратификации
      современного общества.
      <br />
      3) Один из критериев дифференциации социальных групп – доход.
      <br />
      4) Социологи различают индивидуальную и групповую мобильность.
      <br />
      5) Одним из критериев социальной стратификации общества служит доступ к
      власти.
    </div>
  );
  let in7 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) К харизматическому типу политического лидерства относятся лидеры,
      наделённые, по мнению других людей, особыми, выдающимися качествами.
      <br />
      2) Авторитарный стиль характеризуется тем, что лидер, выполняя свои
      функции, всегда учитывает мнение ведомых, развивает их творческое
      отношение к делу.
      <br />
      3) По способу легитимации власти различают легальный
      (рациональнолегальный), традиционный и харизматический типы лидерства.
      <br />
      4) Политическое лидерство – это устойчивое, приоритетное и легитимное
      влияние одного или нескольких лиц, выполняющих властные функции, на
      общество.
      <br />
      5) Любой политический лидер обязательно является лидером партии.
    </div>
  );
  let in8 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) зависимость количества депутатских мандатов, полученных партией, от
      количества голосов избирателей <br />
      2) свободное и добровольное участие граждан в выборах <br />
      3) наличие этапа предвыборной агитации <br />
      4) возможность выдвижения независимых беспартийных кандидатов <br />
      5) процедура тайного голосования <br />
      6) голосование по одномандатным округам
    </div>
  );
  let in9 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) выбор рода деятельности и профессии
      <br />
      2) защита Отечества
      <br />
      3) владение собственностью
      <br />
      4) сохранение природы и окружающей среды
      <br />
      5) забота совершеннолетних трудоспособных детей о нетрудоспособных
      родителях
    </div>
  );
  let in10 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) Уголовное судопроизводство имеет своим назначением защиту личности от
      незаконного и необоснованного обвинения, осуждения, ограничения её прав и
      свобод.
      <br />
      2) Обвинительный приговор может быть основан на предположениях.
      <br />
      3) Судьи рассматривают и разрешают уголовные дела в условиях, исключающих
      постороннее воздействие на них.
      <br />
      4) Функции обвинения, защиты и разрешения уголовного дела не могут быть
      возложены на одно и то же должностное лицо.
      <br />
      5) Уголовное судопроизводство ведётся только на родном языке потерпевшего.
    </div>
  );
  let in11 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) предупреждение
      <br />
      2) выговор
      <br />
      3) замечание
      <br />
      4) дисквалификация
      <br />
      5) исправительные работы
      <br />
      6) увольнение по соответствующим основаниям
    </div>
  );
  let in12 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1) Высокая содержательная сложность. <br />
      2) Демократизм. <br />
      3) Ориентация на узкий круг ценителей. <br />
      4) Широкая рекламная кампания. <br />
      5) Соответствие изысканным вкусам. <br />
      6) Безграничное самовыражение автора.
    </div>
  );
  let in13 = (
    <div className="text-white md:text-2xl lg:text-3xl mt-10  robotoMono">
      1)Указание своей национальности. <br />
      2)Сохранение исторического и культурного наследия. <br />
      3)Участие в выборах органов власти. <br />
      4)Уплата налогов. <br />
      5)Свободное распоряжение своими способностями к труду.
      <br />
      6)Пользование родным языком.
    </div>
  );
  return (
    <TestIS
      lesson="Обществознание Егэ"
      arr={[
        [
          {
            question: `Ниже приведён перечень признаков. Все они, за исключением двух,
            характеризуют динамичный характер общества.`,
            inner: in1,
            RightAnswer: "16",
            name: "id1",
          },
          {
            question: `Выберите верные суждения о человеке и запишите цифры, под которыми они
            указаны. `,
            inner: in2,

            RightAnswer: "125",
            name: "id2",
          },
          {
            question: `Один из телевизионных каналов снял многосерийный фильм о жизни
            нескольких поколений одной семьи. Что из перечисленного позволяет
            отнести этот сериал к произведениям массовой культуры? Запишите цифры,
            под которыми указаны признаки произведений массовой культуры`,
            inner: in3,
            RightAnswer: "346",
            name: "id3",
          },
          {
            question: `Выберите верные суждения о финансовых институтах и запишите цифры,
            под которыми они указаны.`,
            inner: in4,

            RightAnswer: "234",
            name: "id3",
          },
          {
            question: `Фирма «Лисичка» – ателье, специализирующееся на пошиве школьной
            формы. Найдите в приведённом списке примеры постоянных издержек
            фирмы «Лисичка» в краткосрочном периоде и запишите цифры, под
            которыми они указаны`,
            inner: in5,

            RightAnswer: "4",
            name: "id3",
          },
          {
            question: `Выберите верные суждения о социальной стратификации и социальной
            мобильности и запишите цифры, под которыми они указаны`,
            inner: in6,

            RightAnswer: "345",
            name: "id3",
          },
          {
            question: `Выберите верные суждения о политическом лидерстве и запишите цифры,
            под которыми они указаны.`,
            inner: in7,

            RightAnswer: "134",
            name: "id3",
          },
          {
            question: `В демократическом государстве Z после реформы избирательной системы
            выборов в парламент произошёл переход от пропорциональной
            избирательной системы к мажоритарной.
            Что из перечисленного осталось неизменным в результате этой
            избирательной реформы? Запишите соответствующие цифры.`,
            inner: in8,

            RightAnswer: "235",
            name: "id3",
          },
          {
            question: `Что из перечисленного относится к конституционным обязанностям
            гражданина Российской Федерации? Запишите цифры, под которыми они
            указаны.`,
            inner: in9,

            RightAnswer: "245",
            name: "id3",
          },
          {
            question: `Выберите верные суждения о нормах уголовно-процессуального права
            в Российской Федерации и запишите цифры, под которыми они указаны.`,
            inner: in10,

            RightAnswer: "134",
            name: "id3",
          },
          {
            question: `Представьте, что Вы помогаете учителю оформить презентацию к уроку
            обществознания по теме «Юридическая ответственность». Один из слайдов
            называется «Дисциплинарные взыскания, установленные Трудовым
            кодексом Российской Федерации». Что из перечисленного Вы включили бы
            в этот слайд? Запишите цифры, под которыми указаны дисциплинарные
            взыскания.`,
            inner: in11,

            RightAnswer: "236",
            name: "id3",
          },
          {
            question: `Найдите в приведенном ниже списке признаки, характеризующие элитарную культуру, и запишите цифры, под которыми они указаны.`,
            inner: in12,

            RightAnswer: "1356",
            name: "id3",
          },
          {
            question: `Что из перечисленного относится к конституционным обязанностям граждан РФ? Запишите цифры, под которыми указаны конституционные обязанности.`,
            inner: in13,

            RightAnswer: "24",
            name: "id3",
          },
          {
            question: `Ваше имя`,

            RightAnswer: "",
            name: "id3",
            mn: true,
          },
          {
            question: `Ваш номер телефона`,

            RightAnswer: "",
            name: "id3",
            phone: true,
          },
          {
            question: `Вам перезвонят и сообщать ваши результаты`,
          },
        ],
      ]}
    />
  );
}

export default SocEge;
