import React from "react";
import TestIS from "./TestIS";

function RusOge() {
  let in1 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="mb-5">
        (1)Язык – это зеркало, которое стоит между нами и миром, отражая общие
        представления всех говорящих на нём. (2)Причём зеркало языка отражает не
        все свойства окружающей действительности, а только те, которые казались
        особенно важными предкам – носителям этого языка. (3)Так, в языках
        некоторых северных народов: эскимосов, чукчей, коряков ‒ существует
        множество названий снега. (4)Люди понимают: снег занимает в их жизни
        заметное место, его количество, состояние, цвет очень важны. (5)Каждый
        язык отражает картину мира и через грамматику, поэтому существуют языки,
        имеющие более тридцати падежей, которые служат способом указать точное
        положение предмета в пространстве.
      </p>
      1) язык – зеркало (пр. 1) <br />
      2) которые казались важными (пр. 2) <br />
      3) существует множество названий снега (пр. 3) <br />
      4) состояние, цвет важны (пр. 4) <br />
      5) язык отражает (пр. 5)
    </div>
  );

  let in2 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      (1)Язык – это зеркало, которое стоит между нами и миром, отражая общие
      представления всех говорящих на нём. (2)Причём зеркало языка отражает не
      все свойства окружающей действительности, а только те, которые казались
      особенно важными предкам – носителям этого языка. (3)Так, в языках
      некоторых северных народов: эскимосов, чукчей, коряков ‒ существует
      множество названий снега. (4)Люди понимают: снег занимает в их жизни
      заметное место, его количество, состояние, цвет очень важны. (5)Каждый
      язык отражает картину мира и через грамматику, поэтому существуют языки,
      имеющие более тридцати падежей, которые служат способом указать точное
      положение предмета в пространстве.
      <p className="mb-5">
        1) Во второй части предложения 1 использовано составное глагольное
        сказуемое. <br /> 2) Вторая часть сложного предложения 2 осложнена
        обособленным согласованным приложением. <br /> 3) Предложение 3 простое
        двусоставное. <br /> 4) В предложении 4 содержится три грамматические
        основы. <br /> 5) Предложение 5 сложное с бессоюзной и союзной
        сочинительной связями между частями.
      </p>
    </div>
  );
  let in3 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        По мнению психологов (1) чувство (2) это внутреннее отношение человека к
        окружающему миру. Любовь и ненависть (3) страх и радость (4) эти и
        многие другие состояния человека (6) сформированы миллионами лет
        эволюции.
      </p>
    </div>
  );
  let in4 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        1) ЗАРНИЦА – написание безударной чередующейся гласной в корне зависит
        от ударения. <br />
        2) КИСЛО-СЛАДКИЙ (соус) – сложное имя прилагательное, образованное на
        основе подчинительного словосочетания, пишется через дефис. <br />
        3) ЗАМЕЧЕННЫЕ (недостатки) – в полном страдательном причастии прошедшего
        времени совершенного вида пишется НН. <br />
        4) ВСКАЧЬ (нёсся) – на конце наречия после шипящего пишется буква Ь.
        <br />
        5) ПОДРИСОВАТЬ – на конце приставки перед звонким согласным пишется
        буква Д.
      </p>
    </div>
  );
  let in5 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        Веч..(1)реет. Когда на неб..(2) догора..(3)т последн..(4)й луч, из
        пр..(5)брежных заросл..(6)й раздаются таинств..(7)нные шорохи. Мы
        проб..(8)раемся к дальн..(9)му лесу.
      </p>
    </div>
  );
  let in6 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        Наши (тренер) – живые легенды российского фигурного катания.
      </p>
    </div>
  );
  let in7 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="mb-5">
        (1)Журка опять потянулся к полкам и взял самую прочную и новую на вид
        книгу с золотыми узорами на корешке. (2)Это оказались «Три мушкетёра» ‒
        старые друзья, которым Журка обрадовался, он начал перелистывать
        страницы, разглядывая картинки… (3)И вдруг увидел между страницами узкий
        белый конверт. (4)Видимо, дедушка решил, что, если все другие книги
        покажутся Журке неинтересными, то «Мушкетёров» он всё равно пролистает
        до конца. (5)Тем же прямым почерком, каким раньше дед писал короткие
        поздравления на открытках, на конверте было выведено: Ю р и к у.
        (6)Журка сперва сам не знал, чего испугался, хотя нет, не испугался, а
        задрожал от непонятной тревоги. (7)Оглянулся на прикрытую дверь, подошёл
        к окну и, суетливо дёргая пальцами, оторвал у конверта край.
        (8)Развернул большой тонкий лист… (9)Дед писал чёткими, почти печатными
        буквами: «(10)Журавлик! (11)Книги на этих полках – тебе. (12)Это старые
        мудрые книги, в них есть душа. (13)Я их очень любил. (14)Ты сбереги их,
        родной мой, и придёт время, когда они станут твоими друзьями. (15)Я это
        знаю, потому что помню, как ты слушал истории о плаваниях Беринга и
        Крузенштерна и как однажды пытался сочинить стихи про Галактику,
        помнишь? (16)Малыш мой крылатый, ты не знаешь, как я тебя люблю.
        (17)Жаль, что из-за разных нелепостей мы виделись так редко. (18)В эти
        дни я всё время вспоминаю тебя. (19)Чаще всего, как мы идём по берегу
        Каменки и я рассказываю тебе про своё детство и большого змея. (20)Про
        то, как он тащит меня в лёгкой тележке сквозь луговую траву, и я вот-вот
        взлечу за ним. (21)Жаль, что так быстро оборвалась тонкая бечева… (22)В
        детстве я утешал себя, что змей не упал за лесом, а улетел в далёкие
        края и когда-нибудь вернётся. (23)И его бумага будет пахнуть солёными
        брызгами моря и соком тропических растений. (24)Наверно, потому я к
        старости и стал собирать эти книги: мне казалось, что они пахнут так же.
        (25)И сейчас я оставляю всё это тебе, как моему самому большому и
        настоящему другу. (26)Может быть, эти книги помогут тебе взлететь.
        (27)Журка, вспоминай меня, ладно? (28)Ты вспоминай, как мы расклеивали в
        твоём альбоме марки, говорили о кораблях и созвездиях, а вечерами
        смотрели на поезда. (29)И учись летать высоко и смело! (30)Ты сумеешь.
        (31)Если тяжело будет – выдержишь, если больно – вытерпишь, если страшно
        – преодолеешь. (32)Самое трудное знаешь что? (33)Когда ты считаешь, что
        надо делать одно, а тебе говорят: делай другое. (34)И говорят хором,
        говорят самые справедливые слова, и ты сам уже начинаешь думать: а ведь,
        наверное, они и в самом деле правы. (35)Может случиться, что правы.
        (36)Но если будет в тебе хоть капелька сомнения, если в самой-самой
        глубине души осталась крошка уверенности, что прав ты, а не они, делай
        посвоему. (37)Не оправдывай себя чужими правильными словами. (38)Прости
        меня, я, наверное, длинно и непонятно пишу… (39)Нет, ты поймёшь, ведь ты
        у меня славный, умница. (40)Жаль, что я тебя, кажется, больше никогда не
        увижу. (41)Никогда не писал длинных писем. (42)Никому. (43)А теперь не
        хочется заканчивать. (44)Будто рвётся нить… (45)Видишь, какое длинное
        письмо написал тебе, мой настоящий друг, твой дед Юрий Савельев».
        (46)Журка дочитал письмо и сразу, не сдерживаясь, заплакал. (47)Его
        резанули тоска и одиночество, которые рвались из этого письма. (48)И
        любовь к нему, к Журке, о которой он, оказывается, и не знал…
      </p>
      1) Книга «Три мушкетёра» была в старой, разорванной обложке, потому что её
      очень часто читали.
      <br />
      2) Дедушка вложил в томик «Три мушкетёра» поздравительную открытку в
      конверте, на котором было выведено: Ю р и к у.
      <br />
      3) В прошлом дедушка и внук вместе расклеивали марки в альбоме, говорили о
      кораблях и созвездиях, смотрели на поезда.
      <br />
      4) Прочитав письмо, Журка почувствовал, как сильно его любил дедушка.
      <br />
      5) Дедушка подарил Журке воздушного змея.
    </div>
  );
  let in8 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        1) Журка опять потянулся к полкам и взял самую прочную и новую на вид
        книгу с золотыми узорами на корешке.
        <br /> 2) Оглянулся на прикрытую дверь, подошёл к окну и, суетливо
        дёргая пальцами, оторвал у конверта край.
        <br />
        3) Может быть, эти книги помогут тебе взлететь.
        <br />
        4) Нет, ты поймёшь, ведь ты у меня славный, умница.
        <br />
        5) Его резанули тоска и одиночество, которые рвались из этого письма.
      </p>
    </div>
  );

  let in9 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      <p className="">
        (1)Журка опять потянулся к полкам и взял самую прочную и новую на вид
        книгу с золотыми узорами на корешке. (2)Это оказались «Три мушкетёра» ‒
        старые друзья, которым Журка обрадовался, он начал перелистывать
        страницы, разглядывая картинки… (3)И вдруг увидел между страницами узкий
        белый конверт. (4)Видимо, дедушка решил, что, если все другие книги
        покажутся Журке неинтересными, то «Мушкетёров» он всё равно пролистает
        до конца. (5)Тем же прямым почерком, каким раньше дед писал короткие
        поздравления на открытках, на конверте было выведено: Ю р и к у.
        (6)Журка сперва сам не знал, чего испугался, хотя нет, не испугался, а
        задрожал от непонятной тревоги. (7)Оглянулся на прикрытую дверь, подошёл
        к окну и, суетливо дёргая пальцами, оторвал у конверта край.
        (8)Развернул большой тонкий лист… (9)Дед писал чёткими, почти печатными
        буквами: «(10)Журавлик! (11)Книги на этих полках – тебе. (12)Это старые
        мудрые книги, в них есть душа. (13)Я их очень любил. (14)Ты сбереги их,
        родной мой, и придёт время, когда они станут твоими друзьями. (15)Я это
        знаю, потому что помню, как ты слушал истории о плаваниях Беринга и
        Крузенштерна и как однажды пытался сочинить стихи про Галактику,
        помнишь? (16)Малыш мой крылатый, ты не знаешь, как я тебя люблю.
        (17)Жаль, что из-за разных нелепостей мы виделись так редко. (18)В эти
        дни я всё время вспоминаю тебя. (19)Чаще всего, как мы идём по берегу
        Каменки и я рассказываю тебе про своё детство и большого змея. (20)Про
        то, как он тащит меня в лёгкой тележке сквозь луговую траву, и я вот-вот
        взлечу за ним. (21)Жаль, что так быстро оборвалась тонкая бечева… (22)В
        детстве я утешал себя, что змей не упал за лесом, а улетел в далёкие
        края и когда-нибудь вернётся. (23)И его бумага будет пахнуть солёными
        брызгами моря и соком тропических растений. (24)Наверно, потому я к
        старости и стал собирать эти книги: мне казалось, что они пахнут так же.
        (25)И сейчас я оставляю всё это тебе, как моему самому большому и
        настоящему другу. (26)Может быть, эти книги помогут тебе взлететь.
        (27)Журка, вспоминай меня, ладно? (28)Ты вспоминай, как мы расклеивали в
        твоём альбоме марки, говорили о кораблях и созвездиях, а вечерами
        смотрели на поезда. (29)И учись летать высоко и смело! (30)Ты сумеешь.
        (31)Если тяжело будет – выдержишь, если больно – вытерпишь, если страшно
        – преодолеешь. (32)Самое трудное знаешь что? (33)Когда ты считаешь, что
        надо делать одно, а тебе говорят: делай другое. (34)И говорят хором,
        говорят самые справедливые слова, и ты сам уже начинаешь думать: а ведь,
        наверное, они и в самом деле правы. (35)Может случиться, что правы.
        (36)Но если будет в тебе хоть капелька сомнения, если в самой-самой
        глубине души осталась крошка уверенности, что прав ты, а не они, делай
        посвоему. (37)Не оправдывай себя чужими правильными словами. (38)Прости
        меня, я, наверное, длинно и непонятно пишу… (39)Нет, ты поймёшь, ведь ты
        у меня славный, умница. (40)Жаль, что я тебя, кажется, больше никогда не
        увижу. (41)Никогда не писал длинных писем. (42)Никому. (43)А теперь не
        хочется заканчивать. (44)Будто рвётся нить… (45)Видишь, какое длинное
        письмо написал тебе, мой настоящий друг, твой дед Юрий Савельев».
        (46)Журка дочитал письмо и сразу, не сдерживаясь, заплакал. (47)Его
        резанули тоска и одиночество, которые рвались из этого письма. (48)И
        любовь к нему, к Журке, о которой он, оказывается, и не знал…
      </p>
    </div>
  );
  let in10 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      1) НЕКОТОРЫЙ — в неопределённом местоимении без ударения пишется приставка
      НЕ-. <br />
      2) ПОЛ-ЛИСТА — пишется через дефис, потому что после пол- стоит буква л.{" "}
      <br />
      3) НЕУДАЧНЫЙ — имя прилагательное пишется с НЕ слитно, потому что слово не
      употребляется без НЕ. <br />
      4) НЕНАВИДЯЩИЙ — в суффиксе действительного причастия настоящего времени,
      образованного от глагола II спряжения, пишется буква Я. <br />
      5) СКОШЕННЫЙ (луг) — в полном страдательном причастии прошедшего времени
      совершенного вида пишется НН.
    </div>
  );
  let in11 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      Лабиринты Заяцкого острова (1) настоящая загадка Соловецкого архипелага.
      Это невысокие сооружения (2) выложенные в виде спирали из мелких
      булыжников (3) и (4) имеющие один вход (5) и выход. Над загадкой острова
      учёные бьются с начала XX века (6) однако (7) единого мнения о
      происхождении этих лабиринтов до сих пор не существует. Тайна (8) завесу
      которой пока никто не может приподнять (9) манит к себе большое количество
      туристов.
    </div>
  );
  let in12 = (
    <div className="text-white md:text-2xl lg:text-3xl   robotoMono">
      По (оба) сторонам дороги цвели яблони.
    </div>
  );

  return (
    <TestIS
      lesson="Русский язык ОГЭ"
      arr={[
        [
          {
            question: `Укажите варианты ответов, в которых верно определена грамматическая
            основа в одном из предложений или в одной из частей сложного
            предложения текста. Запишите номера ответов.`,

            RightAnswer: "125",
            name: "id1",
            inner: in1,
          },
          {
            question: `Укажите варианты ответов, в которых даны верные характеристики
            предложений текста. Запишите номера ответов. `,

            RightAnswer: "234",
            inner: in2,
            name: "id2",
          },
          {
            question: `Расставьте знаки препинания. Укажите все цифры, на месте которых
            должны стоять тире.`,
            inner: in3,

            RightAnswer: "24",
            name: "id3",
          },
          {
            question: `Укажите варианты ответов, в которых дано верное объяснение написания
            выделенного слова. Запишите номера ответов. `,

            RightAnswer: "134",
            name: "id3",
            inner: in4,
          },
          {
            question: `Прочитайте текст. Вставьте пропущенные буквы. Укажите все цифры,
            на месте которых пишется буква
            И`,

            RightAnswer: "458",
            name: "id3",
            inner: in5,
          },
          {
            question: `Замените словосочетание «плов по-узбекски», построенное на основе
            примыкания, синонимичным словосочетанием со связью согласование.
            Напишите получившееся словосочетание, соблюдая нормы современного
            русского литературного языка.`,

            RightAnswer: "узбекскийплов",
            name: "id3",
          },
          {
            question: `Какие из высказываний соответствуют содержанию текста? Укажите номера
            ответов.`,

            RightAnswer: "34",
            name: "id3",
            inner: in7,
          },
          {
            question: `Укажите вариаты ответов, в которых средством выразительности речи
            является метафора. Запишите номера ответов`,

            RightAnswer: "35",
            name: "id3",
            inner: in8,
          },
          {
            question: `В предложениях 3‒8 найдите просторечное слово и замените его
            стилистически нейтральным синонимом. Запишите этот синоним. `,

            RightAnswer: "сначала",
            name: "id3",
            inner: in9,
          },
          {
            question: `Укажите варианты ответов, в которых дано верное объяснение написания выделенного слова. Запишите номера этих ответов.`,

            RightAnswer: "245",
            name: "id3",
            inner: in10,
          },
          {
            question: `Расставьте знаки препинания. Укажите цифры, на месте которых в предложении должны стоять запятые.`,

            RightAnswer: "2689",
            name: "id3",
            inner: in11,
          },
          {
            question: `Раскройте скобки и запишите слово «оба» в соответствующей форме, соблюдая нормы современного русского литературного языка.`,

            RightAnswer: "обеим",
            name: "id3",
            inner: in12,
          },
          {
            question: `Замените словосочетание «душевное превосходство», построенное на основе связи согласование, синонимичным словосочетанием со связью управление. Напишите получившееся словосочетание`,

            RightAnswer: "превосходстводуши",
            name: "id3",
          },
          {
            question: `Ваше имя`,

            RightAnswer: "",
            name: "id3",
            mn: true,
          },
          {
            question: `Ваш номер телефона`,

            RightAnswer: "",
            name: "id3",
            phone: true,
          },
          {
            question: `Вам перезвонят и сообщать ваши результаты`,
          },
        ],
      ]}
    />
  );
}

export default RusOge;
